__author__ = 'Нестеров Евгений'

#EASY



# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

a = int(input("Введите произвольное число"))
b = 0
while a > 0:
    b = a % 10
    print(b)
    a = a // 10
print("Все цифры Вашего числа напечатаны, программа завершена!")


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!



c = int(input("Введите произвольное число"))
d = int(input("Введите другое произвольное число"))
x = c
c = d
d = x
print("Теперь ваше первое число: ", c)
print("Теперь ваше второе число: ", d)


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"


age = int(input("Для входа в систему укажите ваш возраст:"))
key = 0
if age >= 18:
    key = 1
    print("Доступ разрешен!")
else:
    print("Извините, пользование данным ресурсом только с 18 лет")


#NORMAL

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.

a = int(input("Введите произвольное число"))
b = a % 10
a = a // 10
while a > 0:
    if a % 10 > b:
        b = a % 10
    a = a // 10
print("Максимальное число ", b)


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

c = int(input("Введите другое произвольное число"))
d = int(input("Введите другое произвольное число"))
c, d = d, c
print("Теперь ваше первое число: ", c)
print("Теперь ваше второе число: ", d)


# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4

# Вспоминаю, как решать квадратные уравнения!:)



HARD

# Задание-1:
# Ваня набрал несколько операций в интерпретаторе и получал результаты:
# 	Код: a == a**2
# 	Результат: True
# 	Код: a == a*2
# 	Результат: True
# 	Код: a > 999999
# 	Результат: True

# Вопрос: Чему была равна переменная a,
# если точно известно, что её значение не изменялось?

# Подсказка: это значение точно есть ;)



a = float("inf")
print(a)

if (a == a**2) & (a == a*2) & (a > 999999):
    print("True")
else:
    print("False")


